{
  "navbar": {
    "home": "Accueil",
    "aboutMe": "Description",
    "experiences": "Expériences",
    "contact": "Contact"
  },
  "header": {
    "bio": "Programmeur full-stack avec un très grand intérêt pour le web"
  },
  "aboutMe": {
    "welcome": "Salut !",
    "part1": "Je suis un programmeur full-stack passionné par la création d'interfaces web et d'API. Diplômé en informatique en 2021, j'ai acquis des compétences en développement web et en création d'interfaces utilisateur conviviales.",
    "part2": "Je conçois et mets en œuvre des pages web esthétiques et fonctionnelles. Mes compétences en développement web me permettent de contribuer de manière significative à tout projet de développement web.",
    "thanks": "Merci de visiter mon portfolio !"
  },
  "experiences": {
    "title": "Mes Expériences",
    "madeWith": "Fait avec : ",
    "ugram": {
      "part1": "Dans le cours Développement d'application web avancé à l'université Laval nous devons faire, en équipe de 6, une application dans le même genre que Instagram. Nous devons faire le front-end et le back-end.",
      "part2": "Le front-end est fait avec React et Material UI. Notre back-end utilise nodejs, Nestjs ainsi que MongoDB. Les deux sont écrits en Typescript.",
      "part3": "Une partie importante du projet est d'utiliser AWS S3 pour héberger les images et pour le déploiement continu. Le projet est en développement actif."
    },
    "ufood": {
      "part1": "Dans le cours Développement d'application web à l'université Laval nous devions faire, en équipe de 6, une application pour trouver des restaurants à proximité et leur écrire une évaluation.",
      "part2": "Le projet a été réalié avec Vue.js 3 et Tailwind CSS. Nous étions évalués selon les fonctionnalités réalisées, la propreté du code et sur l'architecture du projet."
    },
    "porfolio": {
      "part1": "Ce site est fait completement par moi même !",
      "part2": "J'ai utilisé React ainsi que tailwind pour découper les sections en composants réutilisables. Je me suis assuré que le site soit \"responsive\" autant en affichage bureau qu'en affichage mobile.",
      "part3": "La derniere version du site web est déployée automatiquement grâce à Github actions et Github pages. ",
      "githubLink": "Vous pouvez voir le code ici :"
    },
    "IndustrielleAlliance": {
      "part1": "Pendant mon parcours scolaire, j'ai effectué trois stages pendant les 2 dernières années. Les deux premiers stages était un poste de développeur back-end. Je travaillais sur l'api (back-end for front-end) pour la nouvelle application React. L'api était écrit en C# avec .Net Core et stockait les données dans une base de données SQL.",
      "part2": "Mon troisième stage chez Industrielle Alliance était un poste de développeur React. J'ai participé à la création de la nouvelle application pour la vente d'assurance. Le projet utilisait React, Redux, Typescript, Tailwind CSS et Storybook.",
      "techUsed": "Technologies utilisées : "
    }
  },
  "contact": {
    "title": "Contactez-moi !",
    "part1": "Si vous avez une opportunité à me proposer, je suis disponible pour en parler.",
    "part2": "Vous pouvez me contacter soit par LinkedIn ou par courriel à l'adresse suivante :"
  }
}
